![imagen](./img/ejercicios.png)

# INFORMACIÓN DEL PROYECTO

### TÍTULO

# ANALISIS SALARIAL: OPORTUNIDADES EN EL CAMPO DEL DATA SCIENCE

### TEMA

La realización de un estudio relacionando el nivel salarial de un grupo de población con su género, nivel de experiencia, nivel educativo y tipo de puesto de trabajo.

### HIPÓTESIS

**Hipótesis 1 :**

Los salarios de los puestos de trabajos relacionados con data science son mayores que los de otros sectores con mismo nivel educativo.

**Hipótesis 2 :**

Dentro del sector data science ¿Son iguales los salarios entre hombres y mujeres con el mismo puesto de trabajo y nivel educativo?


**Hipótesis 3 :**
Dentro del sector Data Science ¿Existe una relación positiva entre los años de experiencia y el salario?

## OBTENCIÓN DE LOS DATOS

### DATASETS Y FUENTES ALTERNATIVAS DE DATOS

Incluye aquí una breve descripción del dataset o datasets de los que partirás para poder evaluar tu hipótesis. <br>
También incluye el origen de estos datos y su fuente.

Los datos han sido obtenidos de la web [Kaggle](www.kaggle.com).

**DATA SET 1**

[Data set](https://www.kaggle.com/datasets/arnabchaki/data-science-salaries-2023)

**DATA SET 2**

[Data set 2](https://www.kaggle.com/datasets/mohithsairamreddy/salary-data)

Partiendo de dos data set con datos sobre salarios, nivel de educación, género, nivel de experiencia

Muestra mediante un head() los principales datasets con los que vas a trabajar

In [1]:
import numpy as np 
import pandas as pd

In [2]:
df1 = pd.read_csv(r'C:/Users/laura/Desktop/Salary_Data.csv', sep = ',')

In [3]:
df1.shape

(6704, 6)

In [4]:
df1.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [5]:
df2 = pd.read_csv(r'C:/Users/laura/Desktop/ds_salaries.csv', sep = ',')

In [6]:
df2.shape

(3755, 11)

In [7]:
df2.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M